<?php
$sc_list = [
 "ศรีสวัสดิ์วิทยาคารจังหวัดน่าน",
 "สตรีศรีน่าน",
 "บ่อสวกวิทยาคาร",
 "น่านประชาอุทิศ",
 "แม่จริม",
 "บ้านหลวง",
 "นาน้อย",
 "ปัว",
 "ศรัทธาศิลาเพชรรังสรรค์",
 "เมืองแงง",
 "มัธยมป่ากลาง",
 "ท่าวังผาพิทยาคม",
 "สารธรรมวิทยาคาร",
 "หนองบัวพิทยาคม",
 "เมืองยมวิทยาคาร",
 "สา",
 "สาธุกิจประชาสรรค์ รัชมังคลาภิเษก",
 "สารทิศพิทยาคม",
 "ทุ่งช้าง",
 "เชียงกลาง\"ประชาพัฒนา\"",
 "พระธาตุพิทยาคม",
 "นาหมื่นพิทยาคม",
 "เมืองลีประชาสามัคคี",
 "สันติสุขพิทยาคม",
 "บ่อเกลือ",
 "ไตรเขตประชาสามัคคี รัชมังคลาภิเษก",
 "น่านนคร",
 "ศรีนครน่าน",
 "มัธยมพระราชทานเฉลิมพระเกียรติ",
 "นันทบุรีวิทยา ในพระบรมราชานุเคราะห์",
];

foreach ($sc_list as $val) {
 echo $val . "<br />\n";
}